src/src/InformationRegisters/QuotationStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>QuotationStatuses</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuotationStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Quote</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ObsoleteQuotation</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Quote</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/InformationRegisters/QuotationStatuses/Ext/ManagerModule.bsl
#Region InfobaseUpdate

Procedure ProcessDataToUpgradeToNewVersion() Export
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	QuotationStatuses.ObsoleteQuotation AS ObsoleteQuotation,
	|	QuotationStatuses.ObsoleteQuotation AS Document,
	|	QuotationStatuses.Status AS Status
	|FROM
	|	InformationRegister.QuotationStatuses AS QuotationStatuses
	|WHERE
	|	QuotationStatuses.Document = VALUE(Document.Quote.EmptyRef)";
	
	QueryResult = Query.Execute();
	Selection	= QueryResult.Select();
	
	While Selection.Next() Do
		RecordManager = InformationRegisters.QuotationStatuses.CreateRecordManager();
		FillPropertyValues(RecordManager, Selection);
		RecordManager.Write();
	EndDo;
	
EndProcedure

#EndRegion
